In [0]:
import pandas as pd
import numpy as np

In [0]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

In [3]:
#1. Show installed versions
#Sometimes you need to know the pandas version you're using, especially when reading the pandas documentation. You can show the pandas version by typing:
pd.__version__

'1.0.3'

In [4]:
#But if you also need to know the versions of pandas' dependencies, you can use the show_versions() function:
pd.show_versions()

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)
/usr/local/lib/python3.6/dist-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.6.9.final.0
python-bits      : 64
OS               : Linux
OS-release       : 4.19.104+
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.0.3
numpy            : 1.18.4
pytz             : 2018.9
dateutil         : 2.8.1
pip              : 19.3.1
setuptools       : 46.1.3
Cython           : 0.29.17
pytest           : 3.6.4
hypothesis       : None
sphinx           : 1.8.5
blosc            : None
feather          : 0.4.1
xlsxwriter       : None
lxml.etree       : 4.2.6
html5lib         : 1.0.1
pymysql          : None
psycopg2         : 2.7.6.1 (dt dec pq3 ext lo64)
jinja2           : 2.11.2
IPython          : 5.5.0
pandas_datareader: 0.8.1
bs4              : 4.6.3
bottleneck       : 1.3.2
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.2.6
matplotlib       : 3.2.1
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 2.5.9
pandas_gbq       : 0.11.0
pyarrow          : 0.14.1
pytables         : None
pytest           : 3.6.4
pyxlsb           : None
s3fs             : 0.4.2
scipy            : 1.4.1
sqlalchemy       : 1.3.16
tables           : 3.4.4
tabulate         : 0.8.7
xarray           : 0.15.1
xlrd             : 1.1.0
xlwt             : 1.3.0
xlsxwriter       : None
numba            : 0.48.0

In [6]:
#2. Create an example DataFrame
#Let's say that you want to demonstrate some pandas code. You need an example DataFrame to work with.
#There are many ways to do this, but my favorite way is to pass a dictionary to the DataFrame constructor, in which the dictionary keys are 
#the column names and the dictionary values are lists of column values:*/
df = pd.DataFrame({'col one':[100, 200], 'col two':[300, 400]})
df

   col one  col two
0      100      300
1      200      400

In [7]:
#Now if you need a much larger DataFrame, the above method will require way too much typing. 
#In that case, you can use NumPy's random.rand() function, tell it the number of rows and columns, and pass that to the DataFrame constructor:
pd.DataFrame(np.random.rand(4, 8))

          0         1         2  ...         5         6         7
0  0.841920  0.939748  0.669836  ...  0.470558  0.538086  0.848985
1  0.231406  0.332163  0.247904  ...  0.538916  0.065065  0.814540
2  0.158158  0.164038  0.495813  ...  0.534942  0.669544  0.870094
3  0.868722  0.064883  0.651150  ...  0.924015  0.117555  0.323193

[4 rows x 8 columns]

In [8]:
#That's pretty good, but if you also want non-numeric column names, you can coerce a string of letters to a list and then pass that list to the columns parameter:
pd.DataFrame(np.random.rand(4, 8), columns=list('abcdefgh'))

          a         b         c  ...         f         g         h
0  0.552581  0.957872  0.043429  ...  0.855591  0.055729  0.373088
1  0.566868  0.750876  0.204986  ...  0.476541  0.665455  0.764347
2  0.463061  0.998271  0.484373  ...  0.944574  0.850717  0.910362
3  0.886204  0.043032  0.630838  ...  0.887706  0.399221  0.511931

[4 rows x 8 columns]

In [0]:
#As you might guess, your string will need to have the same number of characters as there are columns.

In [9]:
#3. Rename columns
#Let's take a look at the example DataFrame we created in the last trick:
df

   col one  col two
0      100      300
1      200      400

In [0]:
#I prefer to use dot notation to select pandas columns, but that won't work since the column names have spaces. Let's fix this.
#The most flexible method for renaming columns is the rename() method. You pass it a dictionary
#in which the keys are the old names and the values are the new names, and you also specify the axis:
df = df.rename({'col one':'col_one', 'col two':'col_two'}, axis='columns')

In [0]:
#The best thing about this method is that you can use it to rename any number of columns, whether it be just one column or all columns.
#Now if you're going to rename all of the columns at once, a simpler method is just to overwrite the columns attribute of the DataFrame:
df.columns = ['col_one', 'col_two']

In [0]:
#Now if the only thing you're doing is replacing spaces with underscores, 
#an even better method is to use the str.replace() method, since you don't have to type out all of the column names:
df.columns = df.columns.str.replace(' ', '_')

In [15]:
#All three of these methods have the same result, which is to rename the columns so that they don't have any spaces:
df

   col_one  col_two
0      100      300
1      200      400

In [16]:
#Finally, if you just need to add a prefix or suffix to all of your column names, you can use the add_prefix() method...
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [17]:
#...or the add_suffix() method:
df.add_suffix('_Y')

   col_one_Y  col_two_Y
0        100        300
1        200        400

In [18]:
#4. Reverse row order
#Let's take a look at the drinks DataFrame:
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [19]:
#This is a dataset of average alcohol consumption by country. What if you wanted to reverse the order of the rows?
#The most straightforward method is to use the loc accessor and pass it ::-1, which is the same slicing notation used to reverse a Python list:
drinks.loc[::-1].head()

       country  beer_servings  ...  total_litres_of_pure_alcohol      continent
192   Zimbabwe             64  ...                           4.7         Africa
191     Zambia             32  ...                           2.5         Africa
190      Yemen              6  ...                           0.1           Asia
189    Vietnam            111  ...                           2.0           Asia
188  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [20]:
#What if you also wanted to reset the index so that it starts at zero?
#You would use the reset_index() method and tell it to drop the old index entirely:
drinks.loc[::-1].reset_index(drop=True).head()

     country  beer_servings  ...  total_litres_of_pure_alcohol      continent
0   Zimbabwe             64  ...                           4.7         Africa
1     Zambia             32  ...                           2.5         Africa
2      Yemen              6  ...                           0.1           Asia
3    Vietnam            111  ...                           2.0           Asia
4  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [22]:
#As you can see, the rows are in reverse order but the index has been reset to the default integer index.
#5. Reverse column order
#Similar to the previous trick, you can also use loc to reverse the left-to-right order of your columns:
drinks.loc[:, ::-1].head()
#The colon before the comma means "select all rows", and the ::-1 after the comma means "reverse the columns", which is why "country" is now on the right side.

  continent  total_litres_of_pure_alcohol  ...  beer_servings      country
0      Asia                           0.0  ...              0  Afghanistan
1    Europe                           4.9  ...             89      Albania
2    Africa                           0.7  ...             25      Algeria
3    Europe                          12.4  ...            245      Andorra
4    Africa                           5.9  ...            217       Angola

[5 rows x 6 columns]

In [23]:
#6. Select columns by data type

#Here are the data types of the drinks DataFrame:

drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [24]:
#Let's say you need to select only the numeric columns. You can use the select_dtypes() method:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [25]:
#This includes both int and float columns.
#You could also use this method to select just the object columns:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [26]:
#You can tell it to include multiple data types by passing a list:
drinks.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [28]:
#You can also tell it to exclude certain data types:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [29]:
#7. Convert strings to numbers
#Let's create another example DataFrame:
df = pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [30]:
#These numbers are actually stored as strings, which results in object columns:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [31]:
#In order to do mathematical operations on these columns, we need to convert the data types to numeric.
#You can use the astype() method on the first two columns:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [32]:
#However, this would have resulted in an error if you tried to use it on the third column, because that column contains 
#a dash to represent zero and pandas doesn't understand how to handle it.
#Instead, you can use the to_numeric() function on the third column and tell it to convert any invalid input into NaN values:
pd.to_numeric(df.col_three, errors='coerce')

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [33]:
#If you know that the NaN values actually represent zeros, you can fill them with zeros using the fillna() method:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [34]:
#Finally, you can apply this function to the entire DataFrame all at once by using the apply() method:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [35]:
#This one line of code accomplishes our goal, because all of the data types have now been converted to float:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

In [36]:
#8. Reduce DataFrame size
#pandas DataFrames are designed to fit into memory, and so sometimes you need to reduce the DataFrame size in order to work with it on your system.
#Here's the size of the drinks DataFrame:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [37]:
#If you're having performance problems with your DataFrame, or you can't even read it into memory, 
#there are two easy steps you can take during the file reading process to reduce the DataFrame size.
#The first step is to only read in the columns that you actually need, which we specify with the "usecols" parameter:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [39]:
#The second step is to convert any object columns containing categorical data to the category data type, which we specify with the "dtype" parameter:
dtypes = {'continent':'category'}
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=dtypes)
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

In [40]:
#16. Split a string into multiple columns
df = pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],
                   'location':['Los Angeles, CA', 'Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [41]:
#What if we wanted to split the "name" column into three separate columns, for first, middle, and last name? 
#We would use the str.split() method and tell it to split on a space character and expand the results into a DataFrame:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [42]:
#These three columns can actually be saved to the original DataFrame in a single assignment statement:

df[['first', 'middle', 'last']] = df.name.str.split(' ', expand=True)
df

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [43]:
#What if we wanted to split a string, but only keep one of the resulting columns? For example, let's split the location column on "comma space":
df.location.str.split(', ', expand=True)

             0   1
0  Los Angeles  CA
1   Washington  DC

In [44]:
#If we only cared about saving the city name in column 0, we can just select that column and save it to the DataFrame:
df['city'] = df.location.str.split(', ', expand=True)[0]
df

              name         location first  middle   last         city
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe  Los Angeles
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith   Washington

In [45]:
#17. Expand a Series of lists into a DataFrame
df = pd.DataFrame({'col_one':['a', 'b', 'c'], 'col_two':[[10, 40], [20, 50], [30, 60]]})
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [46]:
#There are two columns, and the second column contains regular Python lists of integers.
#If we wanted to expand the second column into its own DataFrame, we can use the apply() method on that column and pass it the Series constructor:
df_new = df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [47]:
#And by using the concat() function, you can combine the original DataFrame with the new DataFrame:
pd.concat([df, df_new], axis='columns')

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60